x = int(input("¬ведите координаты центра окружности x="))
y = int(input("¬ведите координаты центра окружности y="))
r = int(input("¬ведите радиус окружности r="))
ax = int(input("¬ведите координаты точки ax="))
ay = int(input("¬ведите координаты точки ay="))
bx = int(input("¬ведите координаты точки bx="))
by = int(input("¬ведите координаты точки by="))
cx = int(input("¬ведите координаты точки cx="))
cy = int(input("¬ведите координаты точки cy="))
a =  (ax - x) ** 2 + (ay - y) ** 2
if a < r ** 2:
    print("точка a внутри");
if a == r ** 2:
    print("точка a лежит на окружности");
if a > r ** 2:
    print("точка a снаружи");
b = (bx - x) ** 2 + (by - y) ** 2
if b < r ** 2:
    print("точка b внутри");
if b == r ** 2:
    print("точка b лежит на окружности");
if b > r ** 2:
    print("точка b снаружи");
c = (cx - x) ** 2 + (cy - y) ** 2
if c < r ** 2:
    print("точка c внутри");
if c == r ** 2:
    print("точка c лежит на окружности");
if c > r ** 2:
    print("точка c снаружи");